## Introduction to Data Analysis

In [2]:
!ls

Data Analysis with Python.ipynb
Learning Python for Data Science-Examples and Stuff.ipynb
Learning Python for Data Science.ipynb
Statistics with Python.ipynb

# Sourcing Data

In [3]:
import pandas as pd # import libraries
import numpy as np

In [7]:
abalone = pd.read_csv('abalone.data', header=None)

In [8]:
abalone.head() # Read/loaded the dataset into a dataframe

   0      1      2      3       4       5       6      7   8
0  M  0.455  0.365  0.095  0.5140  0.2245  0.1010  0.150  15
1  M  0.350  0.265  0.090  0.2255  0.0995  0.0485  0.070   7
2  F  0.530  0.420  0.135  0.6770  0.2565  0.1415  0.210   9
3  M  0.440  0.365  0.125  0.5160  0.2155  0.1140  0.155  10
4  I  0.330  0.255  0.080  0.2050  0.0895  0.0395  0.055   7

In [9]:
# Name the abalone col
abalone.columns = [
    'Sex', 'Length', 'Diameter', 'Height', 'Whole weight', 'Shucked weight',
    'Viscera weight', 'Shell weight', 'Rings'
]

In [10]:
abalone.head()

,Sex,Length,Diameter,Height,Whole weight,Shucked weight,Viscera weight,Shell weight,Rings
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.150,15
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.070,7
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.210,9
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.155,10
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.055,7

## Sourcing Data from Kaggle

In [11]:
titanic_data = pd.read_csv('train.csv') # Loaded the dataframe into this variable

In [12]:
titanic_data.shape # Looking at the dimension of the dataframe

(891, 12)

In [13]:
titanic_data.columns # Attribute for reading column names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
titanic_data.head() # First five rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
titanic_data.info() # Summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Pandas Data Structure

In [16]:
# At the core: Two data structures 
# DataFrame - 2D - Rows and columns 
# Series - 1D - Columns

In [17]:
titanic_data.head() # DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
titanic_data.shape
# Axis 0 = Rows, Axis 1 = Columns

(891, 12)

In [19]:
type(titanic_data)

pandas.core.frame.DataFrame

In [20]:
titanic_data['Sex'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [21]:
series_titanic = titanic_data['Sex']

In [22]:
series_titanic.shape

(891,)

## Analysis of Extra-marital affairs

In [33]:
# Sourcing data 
# https://vincentarelbundock.github.io/Rdatasets/datasets.html

In [34]:
import pandas as pd # Data Manipulation
import numpy as np # Numerical Analysis
import seaborn as sns # Charts & Graphs
import statistics as st # Statistics

In [35]:
data_affairs = pd.read_csv('Affairs.csv') # Read into a dataframe

In [36]:
data_affairs.shape # Rows & Columns

(601, 10)

In [37]:
data_affairs.head() # First 5 rows

,Unnamed: 0,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
0,4,0,male,37.0,10.00,no,3,18,7,4
1,5,0,female,27.0,4.00,no,4,14,6,4
2,11,0,female,32.0,15.00,yes,1,12,1,4
3,16,0,male,57.0,15.00,yes,5,18,6,5
4,23,0,male,22.0,0.75,no,2,17,6,3

In [38]:
data_affairs.info() # Conscise Summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601 entries, 0 to 600
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     601 non-null    int64
 1   affairs        601 non-null    int64
 2   gender         601 non-null    object
 3   age            601 non-null    float64
 4   yearsmarried   601 non-null    float64
 5   children       601 non-null    object
 6   religiousness  601 non-null    int64
 7   education      601 non-null    int64
 8   occupation     601 non-null    int64
 9   rating         601 non-null    int64
dtypes: float64(2), int64(6), object(2)
memory usage: 47.1+ KB

In [39]:
data_affairs['Unnamed: 0'].head(10)

0     4
1     5
2    11
3    16
4    23
5    29
6    44
7    45
8    47
9    49
Name: Unnamed: 0, dtype: int64

In [40]:
data_affairs_1 = data_affairs.rename(columns={'Unnamed: 0': 'ID'}) # Renaming the 'Unnamed: 0' column

In [41]:
data_affairs_1.head()

,ID,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
0,4,0,male,37.0,10.00,no,3,18,7,4
1,5,0,female,27.0,4.00,no,4,14,6,4
2,11,0,female,32.0,15.00,yes,1,12,1,4
3,16,0,male,57.0,15.00,yes,5,18,6,5
4,23,0,male,22.0,0.75,no,2,17,6,3

In [42]:
data_affairs_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601 entries, 0 to 600
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             601 non-null    int64
 1   affairs        601 non-null    int64
 2   gender         601 non-null    object
 3   age            601 non-null    float64
 4   yearsmarried   601 non-null    float64
 5   children       601 non-null    object
 6   religiousness  601 non-null    int64
 7   education      601 non-null    int64
 8   occupation     601 non-null    int64
 9   rating         601 non-null    int64
dtypes: float64(2), int64(6), object(2)
memory usage: 47.1+ KB

In [43]:
data_affairs_1['ID'].head() # first 5 rows/observations

0     4
1     5
2    11
3    16
4    23
Name: ID, dtype: int64

In [44]:
# Look at the affairs column
data_affairs_1['affairs'].head()

0    0
1    0
2    0
3    0
4    0
Name: affairs, dtype: int64

In [45]:
data_affairs_1['affairs'].tail() # last 5 rows/observations

596    1
597    7
598    2
599    2
600    1
Name: affairs, dtype: int64

In [46]:
# create a dict
replace_affairs = {0 : 'none', 1 : 'once', 2 : 'twice',
                   3: '3 times', 7 : '4–10 times', 
                   12 : 'monthly/weekly/daily'}

In [47]:
print(replace_affairs)

{0: 'none', 1: 'once', 2: 'twice', 3: '3 times', 7: '4–10 times', 12: 'monthly/weekly/daily'}

In [48]:
data_affairs_1['affairs'].unique() # checking unique values

array([ 0,  3,  7, 12,  1,  2])

In [49]:
data_affairs_1['affairs'] = data_affairs_1['affairs'].replace(replace_affairs)

In [50]:
data_affairs_1['affairs'].head()

0    none
1    none
2    none
3    none
4    none
Name: affairs, dtype: object

In [51]:
data_affairs_1['affairs'].tail()

596          once
597    4–10 times
598         twice
599         twice
600          once
Name: affairs, dtype: object

In [52]:
data_affairs_1.head()

,ID,affairs,gender,age,yearsmarried,children,religiousness,education,occupation,rating
0,4,none,male,37.0,10.00,no,3,18,7,4
1,5,none,female,27.0,4.00,no,4,14,6,4
2,11,none,female,32.0,15.00,yes,1,12,1,4
3,16,none,male,57.0,15.00,yes,5,18,6,5
4,23,none,male,22.0,0.75,no,2,17,6,3

In [53]:
data_affairs_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601 entries, 0 to 600
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             601 non-null    int64
 1   affairs        601 non-null    object
 2   gender         601 non-null    object
 3   age            601 non-null    float64
 4   yearsmarried   601 non-null    float64
 5   children       601 non-null    object
 6   religiousness  601 non-null    int64
 7   education      601 non-null    int64
 8   occupation     601 non-null    int64
 9   rating         601 non-null    int64
dtypes: float64(2), int64(5), object(3)
memory usage: 47.1+ KB